{
  "project": "tagging-rugby-cli",
  "branchName": "ralph/tackle-stats-table",
  "description": "Replace Top Players leaderboard with a full Tackle Stats table showing all players, totals row, and sortable columns",
  "userStories": [
    {
      "id": "US-102",
      "title": "Replace Top Players with Tackle Stats table in bordered container",
      "description": "As a user, I want to see all players' tackle stats in a table so I can compare performance across the full squad, not just the top 5.",
      "acceptanceCriteria": [
        "Remove the Top Players section from StatsPanel() in tui/components/statspanel.go",
        "Replace it with a table rendered inside RenderInfoBox with header 'Tackle Stats'",
        "Table has a header row with short column labels: Player, Tot, Comp, Miss, Pct",
        "A totals row appears directly below the header row, summing Total, Completed, Missed across all players and showing overall percentage",
        "The totals row is visually distinct from player rows (e.g. bold or different foreground colour like styles.Cyan)",
        "All players from the tackleStats slice are shown — not capped at 5",
        "Rows beyond available height are simply not rendered (no scrolling)",
        "Player names are truncated with ellipsis if they exceed the available name column width",
        "Numeric columns (Tot, Comp, Miss, Pct) are right-aligned",
        "Percentage displays as integer with % suffix (e.g. '85%'), or '-' when Completed + Missed is zero",
        "Table renders correctly at column 3 widths from 18 to 40+ characters",
        "Summary and Event Distribution sections above remain unchanged",
        "Typecheck passes (CGO_ENABLED=0 go vet ./...)"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-103",
      "title": "Add sort keybinding to cycle Tackle Stats table sort column",
      "description": "As a user, I want to change the sort order of the tackle stats table via a keybinding so I can rank players by different metrics.",
      "acceptanceCriteria": [
        "Add a tackleSortColumn field to the Model (int or enum) with default value sorting by Total descending",
        "A keybinding in normal mode (e.g. 's' — verify it is not already bound) cycles through sort columns: Total, Completed, Missed, Percentage, Player",
        "The keybinding is guarded by the same checks as other normal-mode keys (not active during forms, command input, stats view, or help)",
        "Sorting happens at render time in StatsPanel — the source tackleStats slice is not mutated",
        "Descending order for numeric columns (Total, Completed, Missed, Percentage), ascending for Player (alphabetical)",
        "The active sort column is visually indicated in the table header (e.g. highlighted colour or arrow character)",
        "The totals row always stays pinned below the header regardless of sort order",
        "Add the sort keybinding to the help overlay in tui/components/help.go",
        "Add the sort keybinding to the controls display in tui/components/controls.go via GetControlGroups()",
        "Typecheck passes (CGO_ENABLED=0 go vet ./...)"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    }
  ]
}
