{
  "project": "tagging-rugby-cli",
  "branchName": "ralph/tackle-stats-table",
  "description": "Replace Top Players with Tackle Stats Table - Show all players' tackle stats in Column 3 with a pinned totals row, replacing the limited top-5 leaderboard",
  "userStories": [
    {
      "id": "US-001",
      "title": "Replace Top Players leaderboard with tackle stats table",
      "description": "As a user, I want to see a full tackle stats table in Column 3 so that I can see every player's tackle data without opening the full-screen StatsView.",
      "acceptanceCriteria": [
        "The 'Top Players' section in StatsPanel (statspanel.go) is replaced with a 'Tackle Stats' section",
        "Table has a header row with columns: Player, Total, Comp, Miss, %",
        "A TOTAL row appears immediately after the header, summing Total/Comp/Miss across all players and showing overall % (sum completed / (sum completed + sum missed) * 100)",
        "The TOTAL row is styled distinctly from player rows (use styles.Cyan for the totals row text, styles.Pink+Bold for headers)",
        "All players from tackleStats are displayed (no top-5 limit)",
        "Players sorted by total tackles descending, alphabetical name as tiebreaker",
        "Player name column truncates long names to fit available width",
        "% column shows '-' when a player has zero completed + missed tackles",
        "Empty state shows 'No tackle data' in dim italic style when tackleStats is empty",
        "Summary and Event Distribution sections above the table remain unchanged",
        "Typecheck passes (CGO_ENABLED=0 go vet ./...)"
      ],
      "priority": 1,
      "passes": true,
      "notes": "StatsPanel is in tui/components/statspanel.go. It already receives tackleStats []PlayerStats and height int. The Top Players section starts at line 125. PlayerStats struct is in statsview.go with fields: Player, Total, Completed, Missed, Possible, Other, Starred, Percentage. Only display Player, Total, Completed, Missed, Percentage in the new table. The table is read-only — no scrolling or selection interaction. Use all remaining vertical space for player rows. The totals row must be rendered before player rows so it stays visible when Container truncates overflow with the scroll indicator."
    },
    {
      "id": "US-002",
      "title": "Update TUI-ARCHITECTURE.md for tackle stats table",
      "description": "As a developer, I want the architecture doc to reflect the new tackle stats table so documentation stays accurate.",
      "acceptanceCriteria": [
        "The StatsPanel description in TUI-ARCHITECTURE.md Component Contracts section is updated from 'bar graph, category counts, leaderboard' to 'stats summary, bar graph of event distribution, tackle stats table'",
        "The Column 3 row in the column rendering table is updated from 'Live stats panel (bar graph, leaderboard)' to 'Live stats panel (bar graph, tackle stats table)'",
        "No other sections are changed",
        "Typecheck passes (CGO_ENABLED=0 go vet ./...)"
      ],
      "priority": 2,
      "passes": true,
      "notes": "TUI-ARCHITECTURE.md is at tui/TUI-ARCHITECTURE.md. Column 3 description is in the Column Rendering table around line 69. StatsPanel description is in the Component Contracts section around line 157."
    }
  ]
}
